# -*- coding: utf-8 -*-
"""
Created on Tue Apr 15 13:32:40 2025

@author: kun
"""

import random
map = ['起點','一','二','三',
       '監獄','四','五','六',
       '醫院','七','八','九',
       '岩漿湖','十','十一','十二']
mapthing = ['通過起點，補充200血量',
            '遇到網紅「張+0」，因此血量降為原本的25%',
            '遇到可愛貓貓，透過吸貓獲得500血量',
            '走在路上，被高樓盆栽砸到，損失900血量',
            '遺憾入獄，成為獄霸的人體沙包，損失1000血量',
            '遇到我們最帥的系主任，快樂算了3小時數學，獲得3000000血量',
            '遇到最愛的女友，出門過夜，精力被抽乾，損失600血量',
            '遇到我們最愛的班導乃珩，直接被請吃一頓飯，獲得200000血量',
            '進入醫院，補充400血量',
            '大富翁玩到一半被媽媽叫去洗碗，損失700血量',
            '大樂透中3000萬，獲得10000血量',
            '在睡夢中突然夢到自己在自由落體，嚇了一大跳，猛地抽搐了一下，損失1200血量',
            '掉入岩漿湖中，在最後1秒才喝下抗火藥水，血量降為原本的1%',
            '忘記扶老奶奶過馬路，被老奶奶用拐杖打爆，損失800血量',
            '遇見你最愛的鬆軟床鋪，睡了一下，獲得300血量',
            '打遊戲被大佬帶飛，一夜獲得全服最強稱號，獲得100000血量']
maphealth = [200,0,500,-900,-1000,3000000,-600,200000,400,-700,10000,-1200,0,-800,300,100000]
print('您有初始血量1000點，按下enter玩遊戲+骰骰子，輸入Q+enter結束遊戲')
step = 0
health = 1000
while True :
    go = input('在此輸入:')
    if go == '' :
        dice = random.randint(1,6)
        print('您骰到',dice)
        step = step + dice
        step1 = step%16
        if ((step/16) > 1 ) and (step%16 != 0):
            print(mapthing[0])
            health = health + 200
        print(mapthing[step1])
        if step1 == 1 :
            health = health/4
        elif step1 == 12 :
            health = health/100
        else :
            health = health + maphealth[step1]
        print(f'''血量剩餘{health:.0f}''')
        print('')
        if health <= 0:
            print('你沒血了，遊戲結束')
            break
    elif go == 'Q' :
        print('遊戲結束')
        break
    else :
        print('無效指令，請重新遊玩')
        break







